# Gözlem ve Değişken Seçimi: loc & iloc

In [4]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30,size =(10,3))
df = pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0    20    16    14
1    22    24    16
2    11    10     8
3    16    19     5
4    28    26    19
5    29     9    14
6     2    15    22
7     7    19    17
8    15    18    23
9     4     5     3

NameError: name 'df' is not defined

#### loc: tanımlandığı şekli ile seçim yapmak için kullanılır

In [11]:
df.loc[0:3]

   var1  var2  var3
0    20    16    14
1    22    24    16
2    11    10     8
3    16    19     5

In [16]:
df.iloc[:3,:2]

   var1  var2
0    20    16
1    22    24
2    11    10

In [18]:
df.loc[:3,["var2","var3"]]

   var2  var3
0    16    14
1    24    16
2    10     8
3    19     5